  // 首指令地址: 0X104BC
  // 末指令地址: 0X1065C
  if (unique_1b80_1) {
LAB_104F8:
    // 首指令地址: 0X104F8
    // 末指令地址: 0X10514
    if (ZR) {
      do {
        // 首指令地址: 0X105C8
        // 末指令地址: 0X1065C
        if (!unique_1b80_1) {
          break
        }
LAB_104F8:
        // 首指令地址: 0X104F8
        // 末指令地址: 0X10510
      } while (ZR);
    }
    // 首指令地址: 0X10518
    // 末指令地址: 0X10520
    if (unique_2480_1) {
      do {
        // 首指令地址: 0X1063C
        // 末指令地址: 0X1065C
        if (!unique_1b80_1) {
          break
        }
LAB_104F8:
        // 首指令地址: 0X104F8
        // 末指令地址: 0X10514
        if (ZR) {
          do {
            // 首指令地址: 0X105C8
            // 末指令地址: 0X1065C
            if (!unique_1b80_1) {
              break
            }
LAB_104F8:
            // 首指令地址: 0X104F8
            // 末指令地址: 0X10510
          } while (ZR);
        }
        // 首指令地址: 0X10518
        // 末指令地址: 0X10520
      } while (unique_2480_1);
    }
    do {
      // 首指令地址: 0X10524
      // 末指令地址: 0X1052C
      if (ZR) {
        // 首指令地址: 0X10540
        // 末指令地址: 0X1065C
        if (!unique_1b80_1) {
          break
        }
LAB_104F8:
        // 首指令地址: 0X104F8
        // 末指令地址: 0X10514
        if (ZR) {
          do {
            // 首指令地址: 0X105C8
            // 末指令地址: 0X1065C
            if (!unique_1b80_1) {
              break
            }
LAB_104F8:
            // 首指令地址: 0X104F8
            // 末指令地址: 0X10510
          } while (ZR);
        }
      } else {
        // 首指令地址: 0X10530
        // 末指令地址: 0X10538
        if (ZR) {
          // 首指令地址: 0X1057C
          // 末指令地址: 0X105C4
        } else {
          // 首指令地址: 0X1053C
          // 末指令地址: 0X1053C
        }
        // 首指令地址: 0X1063C
        // 末指令地址: 0X1065C
        if (!unique_1b80_1) {
          break
        }
LAB_104F8:
        // 首指令地址: 0X104F8
        // 末指令地址: 0X10514
        if (ZR) {
          do {
            // 首指令地址: 0X105C8
            // 末指令地址: 0X1065C
            if (!unique_1b80_1) {
              break
            }
LAB_104F8:
            // 首指令地址: 0X104F8
            // 末指令地址: 0X10510
          } while (ZR);
        }
      }
      // 首指令地址: 0X10518
      // 末指令地址: 0X10520
    } while (unique_2480_1);
    while (1) {
      do {
        // 首指令地址: 0X1063C
        // 末指令地址: 0X1065C
        if (!unique_1b80_1) {
          break
        }
LAB_104F8:
        // 首指令地址: 0X104F8
        // 末指令地址: 0X10514
        if (ZR) {
          do {
            // 首指令地址: 0X105C8
            // 末指令地址: 0X1065C
            if (!unique_1b80_1) {
              break
            }
LAB_104F8:
            // 首指令地址: 0X104F8
            // 末指令地址: 0X10510
          } while (ZR);
        }
        // 首指令地址: 0X10518
        // 末指令地址: 0X10520
      } while (unique_2480_1);
      do {
        // 首指令地址: 0X10524
        // 末指令地址: 0X1052C
        if (ZR) {
          // 首指令地址: 0X10540
          // 末指令地址: 0X1065C
          if (!unique_1b80_1) {
            break
          }
LAB_104F8:
          // 首指令地址: 0X104F8
          // 末指令地址: 0X10514
          if (ZR) {
            do {
              // 首指令地址: 0X105C8
              // 末指令地址: 0X1065C
              if (!unique_1b80_1) {
                break
              }
LAB_104F8:
              // 首指令地址: 0X104F8
              // 末指令地址: 0X10510
            } while (ZR);
          }
        } else {
          // 首指令地址: 0X10530
          // 末指令地址: 0X10538
          if (ZR) {
            // 首指令地址: 0X1057C
            // 末指令地址: 0X105C4
          } else {
            // 首指令地址: 0X1053C
            // 末指令地址: 0X1053C
          }
          // 首指令地址: 0X1063C
          // 末指令地址: 0X1065C
          if (!unique_1b80_1) {
            break
          }
LAB_104F8:
          // 首指令地址: 0X104F8
          // 末指令地址: 0X10514
          if (ZR) {
            do {
              // 首指令地址: 0X105C8
              // 末指令地址: 0X1065C
              if (!unique_1b80_1) {
                break
              }
LAB_104F8:
              // 首指令地址: 0X104F8
              // 末指令地址: 0X10510
            } while (ZR);
          }
        }
        // 首指令地址: 0X10518
        // 末指令地址: 0X10520
      } while (unique_2480_1);
    }
  } else {
LAB_10660:
    // 首指令地址: 0X10660
    // 末指令地址: 0X10668
    if (ZR) {
LAB_1067C:
      // 首指令地址: 0X1067C
      // 末指令地址: 0X10754
    } else {
LAB_1066C:
      // 首指令地址: 0X1066C
      // 末指令地址: 0X10674
      if (ZR) {
        // 首指令地址: 0X106E4
        // 末指令地址: 0X1072C
      } else {
        // 首指令地址: 0X10678
        // 末指令地址: 0X10678
      }
      // 首指令地址: 0X10730
      // 末指令地址: 0X10754
    }
  }
