  // 首指令地址: 0X209AC
  // 末指令地址: 0X209C4
  while (1) {
    // 首指令地址: 0X20A94
    // 末指令地址: 0X20A9C
    if (unique_1a80_1) {
      // 首指令地址: 0X209C8
      // 末指令地址: 0X209CC
      do {
        // 首指令地址: 0X209D0
        // 末指令地址: 0X209F4
      } while (unique_1a80_1);
      // 首指令地址: 0X209F8
      // 末指令地址: 0X20A24
      if (ZR) {
        // 首指令地址: 0X20A34
        // 末指令地址: 0X20A48
      } else {
        // 首指令地址: 0X20A28
        // 末指令地址: 0X20A2C
        if (unique_1a80_1) {
          // 首指令地址: 0X20A68
          // 末指令地址: 0X20A88
        } else {
          // 首指令地址: 0X20A30
          // 末指令地址: 0X20A64
        }
        // 首指令地址: 0X20A8C
        // 末指令地址: 0X20A8C
      }
      // 首指令地址: 0X20A90
      // 末指令地址: 0X20A90
      continue
    }
    // 首指令地址: 0X20AA0
    // 末指令地址: 0X20AAC
  }
