  // 首指令地址: 0X10420
  // 末指令地址: 0X1043C
  if (unique_2480_1) {
LAB_10450:
    // 首指令地址: 0X10450
    // 末指令地址: 0X10458
    if (ZR) {
LAB_1046C:
      // 首指令地址: 0X1046C
      // 末指令地址: 0X10474
      goto LAB_10484
    } else {
LAB_1045C:
      // 首指令地址: 0X1045C
      // 末指令地址: 0X1045C
      goto LAB_10478
    }
  } else {
LAB_10440:
    // 首指令地址: 0X10440
    // 末指令地址: 0X10448
    if (unique_2480_1) {
LAB_10460:
      // 首指令地址: 0X10460
      // 末指令地址: 0X10468
      goto LAB_10484
    } else {
LAB_1044C:
      // 首指令地址: 0X1044C
LAB_10478:
LAB_10484:
      // 末指令地址: 0X10490
    }
  }
