  // 首指令地址: 0X21974
  // 末指令地址: 0X2198C
  if (unique_1f00_1) {
LAB_219BC:
    // 首指令地址: 0X219BC
    // 末指令地址: 0X219C0
  } else {
LAB_21990:
    // 首指令地址: 0X21990
    // 末指令地址: 0X2199C
    if (ZR) {
LAB_219B0:
      // 首指令地址: 0X219B0
      // 末指令地址: 0X219B8
    } else {
LAB_219A0:
      while (1) {
        // 首指令地址: 0X219A0
        // 末指令地址: 0X219A8
        if (!unique_1a80_1) {
          break
        }
        // 首指令地址: 0X21994
        // 末指令地址: 0X2199C
        if (ZR) {
          break
        }
      }
    }
  }
